In [31]:
# Let's load a new dataset on the number of fires in the Amazon rainforest 

import pandas as pd

file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")

df.tail()

       ano       mes     estado numero  encontro
6449  2012  Dezembro  Tocantins    128  1/1/2012
6450  2013  Dezembro  Tocantins     85  1/1/2013
6451  2014  Dezembro  Tocantins    223  1/1/2014
6452  2015  Dezembro  Tocantins    373  1/1/2015
6453  2016  Dezembro  Tocantins    119  1/1/2016

In [32]:
print(df['ano'].unique())
print(df['mes'].unique())
print(df['estado'].unique())
print(df['numero'].unique())
print(df['encontro'].unique())

[1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
 2012 2013 2014 2015 2016 2017]
['Janeiro' 'Fevereiro' 'Março' 'Abril' 'Maio' 'Junho' 'Julho' 'Agosto'
 'Setembro' 'Outubro' 'Novembro' 'Dezembro']
['Acre' 'alagoas' 'Amapa' 'Amazonas' 'Bahia' 'Ceara' 'Distrito Federal'
 'Espirito Santo' 'Goias' 'Maranhao' 'Mato Grosso' 'Minas Gerais' 'pará'
 'Paraiba' 'Pernambuco' 'Piau' 'Rio' 'rondonia' 'Roraima' 'Santa Catarina'
 'Sao Paulo' 'Sergipe' 'Tocantins']
['0 Fires' '10 Fires' '12 Fires' ... '2.032' '833' '623']
['1/1/1998' '1/1/1999' '1/1/2000' '1/1/2001' '1/1/2002' '1/1/2003'
 '1/1/2004' '1/1/2005' '1/1/2006' '1/1/2007' '1/1/2008' '1/1/2009'
 '1/1/2010' '1/1/2011' '1/1/2012' '1/1/2013' '1/1/2014' '1/1/2015'
 '1/1/2016' '1/1/2017']

In [33]:
new_columns = { 'ano' : 'year',
               'mes' : 'state',
               'estado' : 'month',
               'numero' : 'number_of_fires',
               'encontro' : 'date'}
df.rename(columns = new_columns, inplace = True)

In [34]:
df.head()

   year    state month number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   state            6454 non-null   object
 2   month            6454 non-null   object
 3   number_of_fires  6322 non-null   object
 4   date             6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [36]:
df.columns

Index(['year', 'state', 'month', 'number_of_fires', 'date'], dtype='object')

In [56]:
df.columns[[0,1,2,3,4]]

Index(['year', 'state', 'month', 'number_of_fires', 'date'], dtype='object')

In [57]:
new_order = [4,1,0,2,3]

df = df[df.columns[new_order]]
df.head()

       date    state  year month number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [69]:
df['number_of_fires'].str.isnumeric()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: object

In [70]:
df['number_of_fires'].str.isnumeric()[0:6453:1000]

0       False
1000     True
2000    False
3000     True
4000     True
5000     True
6000     True
Name: number_of_fires, dtype: object

In [71]:
df['number_of_fires'].str.isdigit()[0:6453:1000]

0       False
1000     True
2000    False
3000     True
4000     True
5000     True
6000     True
Name: number_of_fires, dtype: object

In [78]:
df[df['number_of_fires']]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [82]:
df[df['number_of_fires'].astype(str).str.isdigit()]

          date     state  year      month number_of_fires
239   1/1/1998   Janeiro  1998    alagoas               0
240   1/1/1999   Janeiro  1999    alagoas              58
241   1/1/2000   Janeiro  2000    alagoas              11
242   1/1/2001   Janeiro  2001    alagoas               5
243   1/1/2002   Janeiro  2002    alagoas              12
...        ...       ...   ...        ...             ...
6449  1/1/2012  Dezembro  2012  Tocantins             128
6450  1/1/2013  Dezembro  2013  Tocantins              85
6451  1/1/2014  Dezembro  2014  Tocantins             223
6452  1/1/2015  Dezembro  2015  Tocantins             373
6453  1/1/2016  Dezembro  2016  Tocantins             119

[4642 rows x 5 columns]